[
  {
    "title": "Algal Bloom Detector",
    "image": "images/econaut.png",
    "year": 2025,
    "description": "\n          Built a full-stack web application with React/TypeScript frontend and\n          Flask backend, featuring ocean health monitoring dashboard with\n          interactive maps and analytics. Implemented machine learning pipeline\n          multivariate time series forecasting, achieving 87% accuracy in algal\n          bloom detection. Deployed using Netlify and Render.\n        "
  },
  {
    "title": "Recipe Rating Predictor",
    "image": "images/dsc80_project.png",
    "year": 2024,
    "description": "\n          Used the provided Food.com dataset to explore, clean, and prepare\n          training data with scikit-learn and pandas. Engineered features\n          including one-hot tags, ingredient flags, rating statistics,\n          contributor encoding, and nutrition ratios. Trained and tuned a\n          RandomForestClassifier with GridSearchCV and evaluated results on\n          holdout data\n        "
  },
  {
    "title": "One Piece Classifier",
    "image": "images/one_piece.png",
    "year": 2023,
    "description": "Built a PyTorch image classifier for One Piece using transfer-learned CNNs on a custom dataset, shipped as a Flask web app for real-time uploads and predictions. Implemented preprocessing and confidence scoring for accurate, fast character recognition. "
  },
  {
    "title": "Alias sint quos odio!",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2023,
    "description": "\n          Adipisci nobis quasi soluta explicabo hic, veritatis distinctio! Nisi,\n          voluptate esse quas debitis unde explicabo quis nulla quo illum a\n          nesciunt optio ut eum praesentium, provident, nam aspernatur rerum\n          repellat.\n        "
  },
  {
    "title": "Autem voluptatum recusandae possimus!",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2024,
    "description": "\n          Non voluptatibus mollitia sed quisquam ut, aperiam molestiae\n          voluptates commodi porro aut doloribus. Impedit nam magni numquam?\n          Quis atque, a vero labore fuga ratione totam beatae aliquid,\n          laboriosam nobis odio.\n        "
  },
  {
    "title": "Assumenda quos in praesentium.",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2022,
    "description": "\n          Modi nemo vel nam reiciendis cumque blanditiis iure quia deserunt\n          architecto facilis quos nulla, pariatur est commodi iusto corrupti\n          ipsa maxime beatae. A debitis repellendus libero eius fugiat\n          consequuntur magni?\n        "
  },
  {
    "title": "Repudiandae libero deserunt odio!",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2025,
    "description": "\n          Neque iusto excepturi, modi dignissimos porro aspernatur eius nisi\n          molestias alias quod laudantium assumenda eaque earum sapiente at. A\n          harum quod dolores quam voluptate nulla quo dolorem accusamus mollitia\n          similique!\n        "
  },
  {
    "title": "Voluptates expedita necessitatibus deleniti.",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2022,
    "description": "\n          Adipisci eveniet libero, quod repellat ut obcaecati doloribus! Magnam,\n          minima molestias quasi minus praesentium et exercitationem nostrum\n          mollitia nam natus aut sapiente magni, aperiam cum quod velit\n          aspernatur cumque voluptatibus.\n        "
  },
  {
    "title": "Alias, sunt. Ea, ex!",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2023,
    "description": "\n          Quo consectetur consequatur hic quos ut incidunt dolores eligendi\n          nesciunt? Incidunt mollitia explicabo aut, accusamus voluptatum ullam.\n          Laudantium quia, distinctio minus error sint quae. Eos ut odio\n          eligendi laboriosam nobis.\n        "
  },
  {
    "title": "Laboriosam mollitia incidunt laborum.",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2024,
    "description": "\n          Corrupti dolore impedit adipisci voluptate neque ipsum nulla\n          laboriosam praesentium ea exercitationem consectetur quae, et quam\n          sit, delectus distinctio reprehenderit inventore illo unde dolorem\n          veniam odit corporis aut nam? Repellat.\n        "
  },
  {
    "title": "Incidunt id temporibus quas?",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2025,
    "description": "\n          Obcaecati ducimus nulla impedit maiores eaque maxime distinctio quam\n          nemo veniam dignissimos facere, ullam in vitae harum corporis\n          doloribus repudiandae? Ab doloribus consequatur voluptatem a officia\n          fugiat, temporibus aut iure.\n        "
  },
  {
    "title": "Aut, non nobis? Quod!",
    "image": "https://vis-society.github.io/labs/2/images/empty.svg",
    "year": 2025,
    "description": "\n          Enim cupiditate inventore facere, eaque nam unde, similique aliquid,\n          minima cumque ab ut eligendi reprehenderit. Doloremque autem,\n          laudantium excepturi dolore porro fugit iste vero, repellendus ab\n          reiciendis asperiores eius quisquam!\n        "
  }
]
